; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Nick Mattheakis <manikgrc@hotmail.com>
;;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&ўкхсп"
MAIN_DEST_DIR_LABEL = "&КбфЬлпгпт Рсппсйумпэ:"
MAIN_FILE_LABEL = "&БсчеЯп/ЕгкбфбуфЬфзт рспт еобгщгЮ:"
MENU_FILE_LABEL = "&БсчеЯп"
MENU_FILE_QUIT_LABEL = "&ёопдпт"
MENU_EDIT_LABEL = "&ЕреоесгбуЯб"
MENU_EDIT_PREFS_LABEL = "&РспфймЮуейт"
MENU_HELP_LABEL = "&ВпЮиейб"
MENU_HELP_WEB_LABEL = "%s &Йуфьфпрпт"
PREFS_TITLE_LABEL = "РспфймЮуейт"
PREFS_UNIEXTRACT_OPTS_LABEL = "ЕрйлпгЭт Universal Extractor"
PREFS_HISTORY_LABEL = "Рбсбкплпэизуз бсчеЯщн &йуфпсйкпэ"
PREFS_FORMAT_OPTS_LABEL = "ЕрйлпгЭт мпсцпрпЯзузт фэрщн бсчеЯщн"
PREFS_LANG_LABEL = "&Глюууб"
PREFS_DEBUG_LABEL = "&КбфЬлпгпт БсчеЯпх ЕкуцблмЬфщузт:"
PREFS_WARN_EXECUTE_LABEL = "&РспейдпрпЯзуз рсйн фзн екфЭлеуз бсчеЯщн"
PREFS_REMOVE_DUPE_LABEL = "&БцбЯсеуз дйрлюн бсчеЯщн"
PREFS_REMOVE_TEMP_LABEL = "БцбЯсеуз &рспущсйнюн бсчеЯщн"
PREFS_APPEND_EXT_LABEL = "&РспуиЮкз еллейрюн рспекфЬуещн бсчеЯщн"
METHOD_ADMIN_RADIO = "%s Дйбчейсйуфйкьт ЕгкбфбуфЬфзт"
METHOD_EXTRACTION_RADIO = "%s еобгщгЮ"
METHOD_HEADER = "%s ЕобгщгЮ"
METHOD_MSI_NOTE_LABEL = "УзмеЯщуз:"
METHOD_MSI_REQUIRES_LABEL = "З msi2xml чсейЬжефбй фп"
METHOD_MSI_URL_LABEL = "MSXML 6.0 Parser"
METHOD_RADIO_LABEL = "МЭипдпт ЕобгщгЮт"
METHOD_SWITCH_RADIO = "%s дйбкьрфзт"
METHOD_NOTIS_RADIO = "Ден еЯнбй егкбфбуфЬфзт InstallShield"
METHOD_TEXT_LABEL = "%s хрпуфзсЯжей фйт ербкьлпхиет меиьдпхт гйб брпухукехбуЯб %s рбкЭфщн.  Дхуфхчют, кбммЯб брь бхфЭт
фйт меиьдпхт ден еЯнбй 100% бойьрйуфет.  Бн з ео'псйумпэ мЭипдпт ден цбЯнефбй нб дпхлеэей, рбсбкблю обнбфсЭофе %s кбй ерйлЭофе
мйб енбллбкфйкЮ мЭипдп."
METHOD_UNPACKER_RADIO = "%s БрпухукехбуфЮт"

; GUI control functions
DOES_NOT_EXIST = "Ден хцЯуфбфбй.%n"
EXTRACT_TO = "ЕобгщгЮ уе"
INVALID_DIR_SELECTED =  "%s ден еЯнбй Эгкхспт кбфЬлпгпт."
INVALID_FILE_SELECTED = "%sРбсбкблю ерйлЭофе Энб Эгкхсп бсчеЯп."
OPEN_FILE = "ўнпйгмб бсчеЯпх"
SELECT_FILE = "ЕрйлпгЮ бсчеЯпх"
WRITE_TO = "ЕггсбцЮ уе"

; Common terms
TERM_ARCHIVE = "бсчеЯп"
TERM_COMPRESSED = "ухмрйеумЭнп бсчеЯп"
TERM_DISK = "дЯукпт"
TERM_EBOOK = "злекфспнйкь вйвлЯп"
TERM_ECARD = "злекфспнйкЮ кЬсфб"
TERM_ENCODED = "ксхрфпгсбцзмЭнп бсчеЯп"
TERM_EXECUTABLE = "екфелЭуймп"
TERM_FAILED = "брЭфхче"
TERM_HELP = "БсчеЯп впЮиейбт"
TERM_HOTFIX = "ереЯгпхуб ерйдйьсищуз"
TERM_IMAGE = "ейкьнб"
TERM_INSTALLER = "егкбфбуфЬфзт"
TERM_PACKAGE = "рбкЭфп"
TERM_PATCH = "мрЬлщмб"
TERM_SFX = "Бхфп-брпухмрйежьменп"
TERM_STAGE = "УфЬдйп"
TERM_SUCCEEDED = "рЭфхче"
TERM_TESTING = "ДпкймЮ"
TERM_UNKNOWN = "Ьгнщуфп"
TERM_UNPACKED = "брпухукехЬуфзке"
TERM_UPDATER = "ензмЭсщуз"

; Status messages
SCANNING_FILE = "ЕоЭфбуз бсчеЯпх гйб еобксЯвщуз фэрпх бсчеЯпх."
SCANNING_EXE = "ЕоЭфбуз бсчеЯпх ме %s еоЭфбуз."
EXTRACTING = "БрпухукехбуЯб бсчеЯщн брь:"
INIT_WAIT = "БнбмпнЮ гйб бсчйкпрпЯзуз фпх егкбфбуфЬфз.%nРбсбкблю ресймЭнефе."

; Custom prompts
CONVERT_CDROM = "%s Пй ейкьнет CD-ROM ден мрпспэн нб брпухукехбуфпэн кбф'ехиеЯбн.  Бнф'бхфпэ, бхфЮ з ейкьнб%nиб мефбфсбреЯ уе ейкьнб ISO CD-ROM, кбй мефЬ иб брпухукехбуфеЯ.%n%nИЭлефе нб ухнечЯуефе?%nУзмеЯщуз: БхфЮ з дйбдйкбуЯб иб дйбскЭуей месйкЬ лерфЬ."
CONVERT_CDROM_STAGE1_FAILED = "УцЬлмб:  З ейкьнб CD-ROM ден мрьсеуе нб мефбфсбреЯ.%nБн бхфЮ еЯнбй ейкьнб BIN/CUE, уйгпхсехфеЯфе ьфй фп бсчеЯп CUE еЯнбй кбфЬллзлб дйбмпсцщмЭнп."
CONVERT_CDROM_STAGE2_FAILED = "УцЬлмб:  Мйб ейкьнб ISO дзмйпхсгЮизке брь фзн %s ейкьнб, бллЬ ден мрьсеуе нб мефбфсбреЯ.%nИЭлефе нб ксбфЮуефе фзн ейкьнб ISO гйб ресйууьфесз бнЬлхуз?"
CONVERT_BIN_MISSING = "УцЬлмб: Ден всЭизке:%n%s\%s.%s%n%nЧсейЬжпнфбй мбжЯ пй %s.bin кбй %s.cue."
INIT_COMPLETE = "БсчйкпрпЯзуз %s.  Рбсбкблю клеЯуфе фпн егкбфбуфЬфз, кбй мефЬ рбфЮуфе OK гйб нб ухнечЯуефе."
WISE_MSI_PROMPT = "УзмеЯщуз:  БхфЮ з мЭипдпт дпхлеэей мьнп ме ухгкексймЭнб рбкЭфб Wise гйб ЕгкбфбуфЬфз Windows.%nБн п Пдзгьт ЕгкбфЬуфбузт Wise оекйнЬей кбй брлЬ ресймЭней гйб еЯупдп, бхфь фп бсчеЯп ден%nхрпуфзсЯжефбй.  Рбсбкблю клеЯуфе фпн егкбфбуфЬфз, кбй %s иб мбфбйюуей фзн брпухукехбуЯб.%n%nИЭлефе нб ухнечЯуефе?"
UNPACK_PROMPT = "Бхфь фп бсчеЯп еЯнбй рбкефбсйумЭнп ме %s ухмрЯеуз, бллЬ ден мрпсеЯ нб брпухукехбуфеЯ.%nБхфь мрпсеЯ нб пцеЯлефбй уфп ьфй п фэрпт бсчеЯпх ден хрпуфзсЯжефбй, Ю гйбфЯ%nбрлЬ ден хрЬсчпхн бсчеЯб гйб брпухукехбуЯб.%n%nИЭлефе нб брпухукехЬуефе бхфь фп бсчеЯп бнф'бхфпэ?%n%nУзмеЯщуз: Фп брпухукехбумЭнп бсчеЯп иб пнпмбуфеЯ:%n%s\%s_брпухукехЬуфзке.%s"
UNPACK_FAILED = "УцЬлмб:  %s%nден мрьсеуе нб брпухукехбуфеЯ."
WARN_EXECUTE = "РспейдпрпЯзуз:  Гйб нб брпухукехбуфпэн бсчеЯб бхфпэ фпх фэрпх, фп бсчеЯп рсЭрей нб екфелеуфеЯ кбф'ехиеЯбн.%nБн ухнечЯуефе, иб екфелеуфеЯ з бкьлпхиз енфплЮ:%n%n%s%n%nБн рйуфеэефе ьфй бхфь фп бсчеЯп мрпсеЯ нб еЯнбй кбкьвпхлп, рспфеЯнефбй нб мзн рспчщсЮуефе.%nИЭлефе нб рспчщсЮуефе уфзн брпухукехбуЯб?"

; Help text
HELP_SUMMARY = "БрпухукехбуЯб бсчеЯщн брь прпйпдЮрпфе фэрп бсчеЯпх Ю рбкЭфп егкбфбуфЬфз."
HELP_SYNTAX = "%nЧсЮуз:  %s [/help | /prefs] [ьнпмб бсчеЯпх [рсппсйумьт]]"
HELP_ARGUMENTS = "%n%nХрпуфзсйжьменет УхниЮкет:"
HELP_HELP = "%n     /help%t%tЕмцЬнйуз бхфюн фщн рлзспцпсйюн впЮиейбт"
HELP_PREFS = "%n     /prefs%t%tРспубсмпгЮ рспфймЮуещн фпх UniExtract"
HELP_FILENAME = "%n     filename%tјнпмб бсчеЯпх рспт еобгщгЮ"
HELP_DESTINATION = "%n     destination%tКбфЬлпгпт рпх иб гЯней з брпухукехбуЯб"
HELP_SUB = "%n%nУхмрлзсюнпнфбт /sub бнфЯ еньт пньмбфпт кбфбльгпх рсппсйумпэ кбипдзгеЯ%n%s нб брпухукехЬуей уфпн хрпкбфЬлпгп рпх бнбцЭсефбй мефЬ фп бсчеЯп."
HELP_EXAMPLE1 = "%n%nРбсЬдейгмб:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nЗ екфЭлеуз %s чщсЯт кбммЯб ухниЮкз иб%n жзфЮуей брь фпн чсЮуфз фп ьнпмб бсчеЯпх кбй фпн кбфЬлпгп рсппсйумпэ."

; Error messages
CANNOT_LOG = "%s пй брпухукехбуЯет ден мрпспэн нб кбфбчщсзипэн уфп змеспльгйп."
CANNOT_DEBUG = "П кбфЬлпгпт еоьдпх фпх бсчеЯпх екуцблмЬфщузт, "%s", ден еЯнбй еггсЬшймпт.%nБнф'бхфпэ иб чсзуймпрпйзиеЯ п кбфЬлпгпт рспущсйнюн бсчеЯщн."
CANNOT_EXTRACT = "%s ден мрпсеЯ нб брпухукехбуфеЯ.%nП фэрпт бсчеЯпх Юфбн: %s%n%nРбфЮуфе OK бн иЭлефе нб бнблэуефе фп бсчеЯп, Ю ўкхсп гйб Эопдп."
UNKNOWN_EXT = "%s%nЭчей мйб Ьгнщуфз ерЭкфбуз кбй ден мрпсеЯ нб брпухукехбуфеЯ."
INVALID_DIR = "%s%nден мрпсеЯ нб дзмйпхсгзиеЯ.  Рбсбкблю ерйлЭофе Энбн Эгкхсп рсппсйумь."
EXTRACT_FAILED = "%s ден мрпсеЯ нб брпухукехбуфеЯ.%nЦбЯнефбй нб еЯнбй Энб(т) %s, фп прпЯп хрпуфзсЯжефбй, бллЬ з брпухукехбуЯб брЭфхче.%nРбсбкблю деЯфе фп бсчеЯп змесплпгЯпх, %s, гйб ресйууьфесет рлзспцпсЯет.%n%nРбфЮуфе OK гйб емцЬнйуз фпх бсчеЯпх змесплпгЯпх фюсб, Ю ўкхсп гйб Эопдп."

[Installer]
; Components page
COMP_DOCS = "РлзспцпсЯет фекмзсЯщузт кбй бдейпдьфзузт"
COMP_LANG = "БсчеЯб Глщууюн гйб дйеинпрпйзмЭнз хрпуфЮсйоз"
COMP_ACE = "ХрпуфЮсйоз гйб бсчеЯб ACE"
COMP_KGB = "ХрпуфЮсйоз гйб бсчеЯб KGB"
COMP_PEA = "ХрпуфЮсйоз гйб бсчеЯб Pea"
COMP_SIT = "ХрпуфЮсйоз гйб бсчеЯб StuffIt"

; Preferences page
PREFS_CAPTION = "Псйумьт Ерйлпгюн РспгсЬммбфпт"
PREFS_DESCRIPTION = "РпйЭт ерйлпгЭт фпх Universal Extractor иЭлефе нб псЯуефе?"
PREFS_LABEL1 = "МрпсеЯфе нб псЯуефе фйт бкьлпхиет ерйлпгЭт гйб нб схимЯуефе фзн ео'псйумпэ ухмресйцпсЬ фпх Universal Extractor."
PREFS_LABEL2 = "БхфЭт пй ерйлпгЭт мрпспэн нб бллбчфпэн мефЬ фзн егкбфЬуфбуз ме мефбфспрЮ фпх UniExtract.ini."
LANGUAGE_LABEL = "Ео'псйумпэ Глюууб"
DEBUG_LABEL = "ИЭуз бсчеЯпх екуцблмЬфщузт"
APPEND_EXT_LABEL = "&РспуиЮкз еллейрюн ерекфЬуещн бсчеЯщн"
HISTORY_LABEL = "&ДйбфЮсзуз бсчеЯпх йуфпсйкпэ"
REMOVE_DUPE_LABEL = "БцбЯсеуз &дйрлюн бсчеЯщн"
REMOVE_TEMP_LABEL = "БцбЯсеуз &рспущсйнюн бсчеЯщн"
WARN_EXECUTE_LABEL = "&РспейдпрпЯзуз рсйн фзн екфЭлеуз бсчеЯщн"

; Tasks page
ASSOCIATE = "&ЕнесгпрпЯзуз енущмЬфщузт менпэ рлбйуЯпх уфпн ЕоесехнзфЮ"
ASSOCIATE_FILES = "РспуиЮкз UniExtract &БсчеЯб... уфп менпэ рлбйуЯпх"
ASSOCIATE_HERE = "РспуиЮкз UniExtract &Едю уфп менпэ рлбйуЯпх"
ASSOCIATE_SUBDIR = "РспуиЮкз UniExtract уфпн &ХрпкбфЬлпгп уфп менпэ рлбйуЯпх"
ASSOCIATE_FORCE = "Еобнбгкбумьт &ухучЭфйузт ме ьлет фйт хрпуфзсйжьменет дйбмпсцюуейт бсчеЯщн"
MODIFY_PATH = "РспуиЮкз Universal Extractor уфп &мпнпрЬфй фпх ухуфЮмбфпт убт"
DESKTOP_ICON = "ДзмйпхсгЯб еньт &ейкпнйдЯпх уфз ерйцЬнейб есгбуЯбт"
QUICK_LAUNCH_ICON = "ДзмйпхсгЯб &еньт ейкпнйдЯпх ГсЮгпсзт ЕкфЭлеузт"
SENDTO_ICON = "ДзмйпхсгЯб еньт ейкпнйдЯпх БрпуфплЮ&рспт"

; Context Menu integration
EXTRACT_FILES = "UniExtract &БсчеЯб..."
EXTRACT_HERE = "UniExtract &Едю"
EXTRACT_SUB = "UniExtract уфпн &ХрпкбфЬлпгп"
